[
  {
    "name": "agent-basics-guide.md",
    "description": "Read when creating a new agent or understanding agent fundamentals. Shows how to extend OpperatorAgent, implement required methods (initialize/start), use lifecycle hooks (on_shutdown/cleanup/main_loop), structured logging with self.log(), configuration loading, error handling, and complete agent examples"
  },
  {
    "name": "lifecycle-events-guide.md",
    "description": "Read when responding to conversation changes or agent activation. Shows event handlers: on_new_conversation, on_conversation_switched, on_agent_activated/deactivated, on_working_directory_changed, on_config_update. Covers state management, UI updates"
  },
  {
    "name": "agent-tools-guide.md",
    "description": "Read when adding commands that the LLM can call or exposing slash commands to users. Shows how to use register_command() with typed arguments (string, integer, boolean, array, object), argument validation, enum constraints, async commands, progress reporting, return values, error handling, and exposing commands as agent_tool or slash_command"
  },
  {
    "name": "system-prompt-guide.md",
    "description": "Read when you need to inform the LLM about agent state, capabilities, or context. Shows how to use set_system_prompt() to provide dynamic state updates, when to update (state changes, after commands, lifecycle events), keeping prompts concise, structuring information, and updating prompts throughout agent lifecycle"
  },
  {
    "name": "sections-guide.md",
    "description": "Read when building agents that need to display status, progress, or activity in the sidebar. Shows how to create custom sections with register_section()/update_section(), animate progress bars, handle agent lifecycle stages, use colors and ASCII symbols, and implement overview+activity patterns"
  },
  {
    "name": "secret-keys-guide.md",
    "description": "Read when your agent needs secure credentials like API keys, passwords, or tokens. Shows how to use get_secret() to fetch from Opperator's encrypted keyring, security best practices (never log/store secrets), error handling with SecretError, creating secrets via CLI, and common patterns for API authentication and database connections"
  },
  {
    "name": "working-directory-guide.md",
    "description": "Read when your agent needs to work with dynamic directories or understand the user's current directory context. Shows how to use get_working_directory() in command handlers, resolve relative paths, validate paths, react to directory changes with on_working_directory_changed(), and implement file operations with proper path handling"
  },
  {
    "name": "agents-yaml-guide.md",
    "description": "Read when configuring agent daemon management. Shows YAML structure: required fields (name, command, process_root), optional settings (auto_restart, start_with_daemon), cron scheduling, environment variables"
  },
  {
    "name": "background-tasks-guide.md",
    "description": "Read when running periodic tasks, monitoring, or concurrent operations. Shows background threads in start(), worker loops with threading.Event for shutdown, locks for thread safety, thread pools for async commands. Common patterns: periodic tasks, file monitoring"
  },
  {
    "name": "opper-sdk-guide.md",
    "description": "Read when performing AI tasks. Default SDK for all AI operations. Shows opper.call() for structured calls, opper.stream() for real-time responses, Pydantic validation, async operations, AI-powered commands, common patterns (extraction, classification, Q&A)"
  },
  {
    "name": "python-dependencies-guide.md",
    "description": "Read when installing Python packages or troubleshooting dependency issues. Shows workflow: stop agent, update requirements.txt, install using agent's VENV Python, restart. Covers ModuleNotFoundError fixes, VENV corruption recovery, common mistakes"
  },
  {
    "name": "oauth2-guide.md",
    "description": "Read when implementing OAuth 2.0 authentication (Gmail, Drive, GitHub, Microsoft). Shows pattern: user credentials in keyring, tokens in local files. Covers async authorization, callback server, token refresh, sidebar updates"
  }
]
